{
  "template": {
    "role": "",
    "company": "",
    "aboutCompany": "",
    "startDate": "",
    "endDate": "",
    "projects": [
      {
        "name": "",
        "link": "",
        "about": "",
        "technologies": []
      },
      {
        "name": "",
        "link": "",
        "about": "",
        "technologies": []
      },
      {
        "name": "",
        "link": "",
        "about": "",
        "technologies": []
      }
    ]
  },
  "experience": [
    {
      "role": "SENIOR SOFTWARE ENGINEER",
      "company": "RETAIN HEALTH",
      "aboutCompany": "Retain Health is the operator of a healthcare platform intended to identify Alzheimer's risk factors and help build brain-healthy habits. The company uses clinical evidence to offer mobile care to make brain-healthy lifestyle changes, enabling clinicians to treat memory-related diseases.",
      "startDate": "August 2021",
      "endDate": "Present",
      "projects": [
        {
          "name": "Retain",
          "link": "https://retainhealth.com",
          "about": "I serve as a Senior Software Engineer responsible for spearheading the implementation of critical features for the company's flagship product using AngularJS, Express, and AWS RDS, among other tools. Leveraging my expertise in serverless architecture (including AWS Lambda, API Gateway, and AWS WAF), I work diligently to ensure the product's scalability, stability, and security while adhering to strict NDA regulations. In addition to technical responsibilities, I collaborate with a consultant from the U.S. Food and Drug Administration to ensure alignment between the product and software development processes and FDA regulations. By doing so, I ensure that the company's product remains compliant and up-to-date with industry standards. As a leader in the organization, I also play a critical role in recruiting top talent. By conducting interviews and evaluating potential candidates, I help to build and maintain a talented and productive team that can deliver the best results for the company.",
          "technologies": [
            "AngularJS",
            "Express.js",
            "MySQL",
            "AWS Lambda",
            "AWS S3",
            "AWS Cloudwatch",
            "Bootstrap"
          ]
        }
      ]
    },
    {
      "role": "Software Engineer",
      "company": "My Creative Box",
      "aboutCompany": "My Creative Box, an e-commerce company, provides curious kids with the ultimate hands-on fun learning experience in one convenient box - delivered. ",
      "startDate": "May 2021",
      "endDate": "September 2021",
      "projects": [
        {
          "name": "Learn With Mochi",
          "link": "https://learnwithmochi.com/",
          "about": "",
          "technologies": [
            "NextJS",
            "Express",
            "Stripe",
            "PayPal",
            "Typescript",
            "Tailwind CSS",
            "Unit Testing",
            "E2E Testing",
            "Github Actions CI/CD",
            "REST/RESTful APIs"
          ]
        },
        {
          "name": "Robotics Kit",
          "link": "https://learnwithmochi.com/robotics",
          "about": "",
          "technologies": [
            "NextJS",
            "Express",
            "Stripe",
            "PayPal",
            "Typescript",
            "Tailwind CSS",
            "Unit Testing",
            "E2E Testing",
            "Github Actions CI/CD",
            "REST/RESTful APIs"
          ]
        },
        {
          "name": "KiwiLearn",
          "link": "https://kiwilearn.org/",
          "about": "KiwiLearn is a learning exchange that connects teachers and learners in different parts of Aotearoa. Kiwi Learn democratises educational opportunities to give students in every part of New Zealand access to the best teachers no matter where they live.",
          "technologies": [
            "NextJS",
            "Express",
            "Typescript",
            "Tailwind CSS",
            "Enzyme",
            "REST/RESTful APIs"
          ]
        },
        {
          "name": "EHF PRV Scoring Calculator",
          "link": "https://ehf.nzvc.co.nz/",
          "about": "This web application is set up for Edmund Hillary fellows to calculate their PRV points. The calculator is created based on the EHF document and this document is the ground truth. The calculator is a tool to make adding and sharing contributions much easier.",
          "technologies": [
            "Puppeteer",
            "AWS S3",
            "NextJS",
            "Express",
            "Typescript",
            "Tailwind CSS",
            "Unit Testing",
            "E2E Testing",
            "Github Actions CI/CD",
            "REST/RESTful APIs"
          ]
        }
      ]
    },
    {
      "role": "FULLSTACK DEVELOPER",
      "company": "JLS TRADING CO., USA",
      "aboutCompany": "JLS Trading Company is an Amazon Seller Partner which manages private label brands in nearly every consumer category from toys to tools to office products to gourmet food. I worked closely with Process Managers and Product Officers to implement solutions to optimize business processes.",
      "startDate": "October 2020",
      "endDate": "Present",
      "projects": [
        {
          "name": "JLS ERP",
          "link": "https://www.jlserp.com",
          "about": "A SaaS product that enables users to track warehouse or factory inventory, employees, and assets. Built standalone components in React Typescript for the front-end application of the new SaaS product. Wrote exhaustive unit and integration tests in Jest and Enzyme. Wrote documentation for standalone component packages.\nThe company is on track to release the first public beta of the SaaS product. This project is spearheading the company's efforts to diversify its operations.",
          "technologies": [
            "Express.js",
            "React",
            "Typescript",
            "CSS3",
            "Jest",
            "Unit Testing",
            "REST/RESTful APIs"
          ]
        },
        {
          "name": "Warehouse Digitization",
          "link": "",
          "about": "Led the effort to automate and optimize warehouse processes. Developed algorithms in Typescript for optimizing warehouse traversal when fulfilling pick lists. Developed algorithms in Typescript for generating digital addresses for areas within warehouses. Performed exhaustive unit and integration testing with Jest.\nSlashed fuel costs by 35% and order fulfillment time drastically. Improved inventory management by warehouse zoning.",
          "technologies": [
            "Typescript",
            "Algorithms and Data Structures",
            "REST/RESTful APIs",
            "Optimization",
            "Problem Solving"
          ]
        }
      ]
    },
    {
      "role": "LEAD MOBILE APP DEVELOPER",
      "company": "WINK INITIATIVES, GH",
      "aboutCompany": "Wink Initiatives is a collaborative company that explores ideas of young people and helps to develop them into businesses and initiatives that help the community. I led a team of 4 developers to build a blood donation app as part of the company's social initiatives.",
      "startDate": "January 2020",
      "endDate": "January 2021",
      "projects": [
        {
          "name": "Pints App",
          "link": "https://play.google.com/store/apps/details?id=com.pint&hl=en&gl=US",
          "about": "Pint is a mobile app that has the primary function of taking requests from people who need blood donation, matching the blood group of the requester with eligible donors on the app, exchanging contacts between the wiling donor and the blood requester, allowing people to volunteer as blood donors (on standby to be contacted whenever there is an urgent need). This is to help people who are in dire need of blood find people who are willing to donate blood.The early demos of the application attracted investor and media attention as well as the Ghana Medical Association.",
          "technologies": [
            "Google Cloud Platform",
            "Android",
            "Firebase",
            "Typescript",
            "React Native",
            "UI Design"
          ]
        }
      ]
    },
    {
      "role": "FULLSTACK DEVELOPER",
      "company": "ASQII LLC, GH",
      "aboutCompany": "Asqii LLC is a software development company based in Kumasi, Ghana. I worked closely with Engineering Managers to strategize product design and implementation.",
      "startDate": "June 2020",
      "endDate": "October 2020",
      "projects": [
        {
          "name": "Asset Manager NCA",
          "link": "",
          "about": "Developed bespoke fixed asset management software for the National Communications Authority of Ghana using React, Typescript, Express, and TypeORM according to MVC architecture. Provisioned a CI/CD pipeline with Gitlab CI and Heroku. Performed exhaustive unit and integration testing with Jest and Enzyme. Deployed on a Linux server and performed technical training and troubleshooting on the developed asset management system.",
          "technologies": [
            "React",
            "Typescript",
            "Express.js",
            "CSS3",
            "MySQL",
            "Node.js",
            "Integration Testing,"
          ]
        }
      ]
    },
    {
      "role": "LEAD FRONTEND ENGINEER",
      "company": "TRUCKRSOFT TECHNOLOGIES, GH",
      "aboutCompany": "A marketplace app for listing and booking of 3rd party logistics truck services.",
      "startDate": "July 2019",
      "endDate": "September 2019",
      "projects": [
        {
          "name": "Truckr Component Library + Website",
          "link": "https://www.truckrtech.com",
          "about": "Developed reusable components in Vue and React for company projects. Translated UI design, animations, and mockups in Figma into web components. Performed extensive unit testing with Jest and Enzyme. Led the documentation of the component library. Composed the company's website from the created component library.",
          "technologies": [
            "JavaScript",
            "Vue.js",
            "CSS3",
            "HTML",
            "Jest",
            "Figma",
            "React"
          ]
        }
      ]
    },
    {
      "role": "SOFTWARE ENGINEERING INTERN",
      "company": "QUEST SYSTEMS LTD., GH",
      "aboutCompany": "Quest Systems is a software development agency based in Accra, Ghana which develops bespoke software solutions for its clients. I was assigned to a hospital information system project.",
      "startDate": "April 2019",
      "endDate": "June 2019",
      "projects": [
        {
          "name": "Lab Information System Middleware",
          "link": "",
          "about": "Worked a team of interns to develop and deploy middleware in Java with HAPI to interface the Hospitalrun Hospital Information System and a hematology analyzer using the HL7 standard.",
          "technologies": [
            "Java",
            "Algorithms and Data Structures",
            "AWS",
            "Elastic BeanStalk",
            "HL7 Messages",
            "Problem Solving"
          ]
        }
      ]
    },
    {
      "role": "LEAD WEB DEVELOPER",
      "company": "ACES - KNUST",
      "aboutCompany": "The Association of Computer Engineering Students is a student group representing the interests of Computer Engineering students in Kwame Nkrumah University of Science and Technology. I led a team of 4 developers delegating tasks in weekly sprints.",
      "startDate": "January 2018",
      "endDate": "January 2019",
      "projects": [
        {
          "name": "ACES Website",
          "link": "",
          "about": "Designed and defined a design system for ACES. Designed a custom WordPress theme, developed and maintained the website and blog of the Association of Computer Engineering Students in the Kwame Nkrumah University of Science and Technology.",
          "technologies": [
            "MySQL",
            "PHP",
            "CSS3",
            "WordPress"
          ]
        }
      ]
    }
  ]
}