{
  "template": {
    "name": "GREEDY ALGORITHM FOR SCHEDULING LECTURES BY SOFT CONSTRAINT OPTIMIZATION FOR COLLEGE OF ENGINEERING, KNUST",
    "link": "",
    "about": "An implementation of a greedy algorithm in Java which schedules lectures into a workable weekly timetable, taking into consideration a weighted number of soft constraints including the comfort of lecturers and students and the distance between lecture halls. This project solves an NP-hard problem and is set to replace the manual method of scheduling currently employed. This project is still in testing but has so far reduced the time taken for creating workable timetables for the College of Engineering at Kwame Nkrumah University of Science and Technology from 1 week to 1 minute. The front end was built from scratch in Typescript with React and Tailwind CSS.",
    "technologies": [
      "Typescript",
      "CSS3",
      "REST/RESTful APIs",
      "Firebase",
      "Spring Framework",
      "React",
      "Java"
    ]
  },
  "projects": [
    {
      "name": "GREEDY ALGORITHM FOR SCHEDULING LECTURES BY SOFT CONSTRAINT OPTIMIZATION FOR COLLEGE OF ENGINEERING, KNUST",
      "link": "",
      "about": "An implementation of a greedy algorithm in Java which schedules lectures into a workable weekly timetable, taking into consideration a weighted number of soft constraints including the comfort of lecturers and students and the distance between lecture halls. This project solves an NP-hard problem and is set to replace the manual method of scheduling currently employed. This project is still in testing but has so far reduced the time taken for creating workable timetables for the College of Engineering at Kwame Nkrumah University of Science and Technology from 1 week to 1 minute. The front end was built from scratch in Typescript with React and Tailwind CSS.",
      "technologies": [
        "Typescript",
        "CSS3",
        "REST/RESTful APIs",
        "Firebase",
        "Spring Framework",
        "React",
        "Java"
      ]
    },
    {
      "name": "GODSEYE VIDEO SURVEILLANCE BACKEND",
      "link": "",
      "about": "The backend for a surveillance system allows parents to access live feeds from Raspberry PI-based cameras in their wards’ classrooms. It houses the API endpoints for in-house authentication and OAuth, and routines to stream camera frame to authenticated API consumers. It also employs compression of frames for transmission. This project was deployed on AWS and built as a proof of concept for a local company seeking to develop a product like Ring.",
      "technologies": [
        "JavaScript ES6",
        "REST/RESTful APIs",
        "Node.js",
        "Express.js",
        "MongoDB",
        "OAuth APIs"
      ]
    },
    {
      "name": "WOPRI",
      "link": "https://knotuteye.github.io/wopri",
      "about": "A trivia quiz game developed as a Progressive Web Application (PWA). Built with performance and user experience in mind, it was personal experiment on accessibility and extreme optimization for PWAs. It has a Lighthouse performance rating of 99%.",
      "technologies": [
        "CSS3",
        "SEO",
        "REST/RESTful APIs",
        "HTML",
        "JavaScript ES6",
        "Progressive Web App"
      ]
    },
    {
      "name": "SHANNONIZER",
      "link": "https://github.com/knotuteye/shannonizer",
      "about": "In information theory, the entropy of a random variable is the average level of \"information\", \"surprise\", or \"uncertainty\" inherent in the variable's possible outcomes. The concept of information entropy was introduced by Claude Shannon in his 1948 paper \"A Mathematical Theory of Communication\", and is sometimes called Shannon entropy in his honor. Shannonizer is a Python program for calculating self-information or average information (entropy) of an event or series of events in bits.",
      "technologies": [
        "Python",
        "Git",
        "Algorithms and Data Structures",
        "Jekyll"
      ]
    }
  ]
}
